var str1 = "***<没钱赚商店>收据***\n" +
"名称：雪碧，数量：5瓶，单价：3.00(元)，小计：12.00(元)\n" +
"名称：荔枝，数量：2.5斤，单价：15.00(元)，小计：37.50(元)\n" +
"名称：方便面，数量：3袋，单价：4.50(元)，小计：9.00(元)\n" +
"----------------------\n" +
// "总价：58.50(元)\n" +
"节省：7.50(元)\n" +
"**********************"
var str2 = "***<没钱赚商店>收据***\n" +
"名称：雪碧，数量：5瓶，单价：3.00(元)，小计：12.00(元)\n" +
"名称：荔枝，数量：2.5斤，单价：15.00(元)，小计：37.50(元)\n" +
"名称：方便面，数量：3袋，单价：4.50(元)，小计：9.00(元)\n" +
"----------------------\n" +
// "总计：58.50(元)\n" +
"节省：7.50(元)\n" +
"**********************"
console.log(str1);
console.log(str2);
console.log(str1 == str2);
